# Pandas

In [133]:
import pandas as pd
import numpy as np

### Build DataFrame from CSV file

In [134]:
cars = pd.read_csv("datasets/cars.csv")
cars

  country_id  cars_per_cap        country drives_right
0         US           809  United States         True
1        AUS           731      Australia        False
2        JAP           588          Japan        False
3         IN            18          India        False
4         RU           200         Russia         True
5        MOR            70        Morocco         True
6         EG            45          Egypt         True

In [135]:
brics = pd.read_csv("datasets/brics.csv", index_col=0)
brics

         country  population      area    capital
BR        Brazil         200   8515767   Brasilia
RU        Russia         144  17098242     Moscow
IN         India        1252   3287590  New Delhi
CH         China        1357   9596961    Beijing
SA  South Africa          55   1221037   Pretoria

In [136]:
column_names = ['year', 'month', 'day', 'dec_date', 'sunspots', 'definite']
silso = pd.read_csv('datasets/silso.csv', header=None, names=column_names, na_values={'sunspots': [' -1']}, 
                    parse_dates=[[0, 1, 2]])
silso

  year_month_day  dec_date  sunspots  definite
0     1818-01-01  1818.004       NaN         1
1     1818-01-02  1818.007       NaN         1
2     1818-01-03  1818.010       NaN         1
3     1818-01-04  1818.012      22.0         1
4     1818-01-05  1818.015       NaN         1
5     1818-01-06  1818.018       NaN         1
6     1818-01-07  1818.020       NaN         1
7     1818-01-08  1818.023      46.0         1
8     1818-01-09  1818.026      59.0         1
9     1818-01-10  1818.029      63.0         1

### Create DataFrame from dictionary

In [137]:
users_dict = {'weekday': ['Sun', 'Sun', 'Mon', 'Mon'],
              'city': ['Austin', 'Dallas', 'Austin', 'Dallas'],
              'visitors': [139, 237, 326, 456],
              'signups': [7, 12, 3, 5]}
users_df = pd.DataFrame(users_dict)
users_df

     city  signups  visitors weekday
0  Austin        7       139     Sun
1  Dallas       12       237     Sun
2  Austin        3       326     Mon
3  Dallas        5       456     Mon

In [138]:
heights = [59.1, 61.3, 64.7, 60.5, 64.4, 65.2, 61.8]
heights_sex_dict = {'height': heights, 'sex': 'M'}
heights_sex_df = pd.DataFrame(heights_sex_dict)
heights_sex_df

   height sex
0    59.1   M
1    61.3   M
2    64.7   M
3    60.5   M
4    64.4   M
5    65.2   M
6    61.8   M

### Create DataFrame from list

In [139]:
array_df = pd.DataFrame([[1, 2, 3], [4, 5, 6], [7, 8, 9]])
array_df

   0  1  2
0  1  2  3
1  4  5  6
2  7  8  9

### Writing files

In [172]:
users_df.to_csv('datasets/users.csv')

In [173]:
silso.to_excel('datasets/silso.xlsx')

In [140]:
brics.head()

         country  population      area    capital
BR        Brazil         200   8515767   Brasilia
RU        Russia         144  17098242     Moscow
IN         India        1252   3287590  New Delhi
CH         China        1357   9596961    Beijing
SA  South Africa          55   1221037   Pretoria

In [141]:
brics.head(2)

   country  population      area   capital
BR  Brazil         200   8515767  Brasilia
RU  Russia         144  17098242    Moscow

In [142]:
brics.tail()

         country  population      area    capital
BR        Brazil         200   8515767   Brasilia
RU        Russia         144  17098242     Moscow
IN         India        1252   3287590  New Delhi
CH         China        1357   9596961    Beijing
SA  South Africa          55   1221037   Pretoria

In [143]:
brics.tail(2)

         country  population     area   capital
CH         China        1357  9596961   Beijing
SA  South Africa          55  1221037  Pretoria

### DataFrame indexes and columns

In [144]:
type(brics)

pandas.core.frame.DataFrame

In [145]:
brics.columns

Index(['country', 'population', 'area', 'capital'], dtype='object')

In [146]:
type(brics.columns)

pandas.indexes.base.Index

In [147]:
brics.index

Index(['BR', 'RU', 'IN', 'CH', 'SA'], dtype='object')

In [148]:
type(brics.index)

pandas.indexes.base.Index

In [149]:
array_df.columns=["A", "B", "C"]
array_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
A    3 non-null int64
B    3 non-null int64
C    3 non-null int64
dtypes: int64(3)
memory usage: 152.0 bytes

In [150]:
silso.index = silso['year_month_day']
silso.index.name = 'date'
silso

           year_month_day  dec_date  sunspots  definite
date
1818-01-01     1818-01-01  1818.004       NaN         1
1818-01-02     1818-01-02  1818.007       NaN         1
1818-01-03     1818-01-03  1818.010       NaN         1
1818-01-04     1818-01-04  1818.012      22.0         1
1818-01-05     1818-01-05  1818.015       NaN         1
1818-01-06     1818-01-06  1818.018       NaN         1
1818-01-07     1818-01-07  1818.020       NaN         1
1818-01-08     1818-01-08  1818.023      46.0         1
1818-01-09     1818-01-09  1818.026      59.0         1
1818-01-10     1818-01-10  1818.029      63.0         1

In [151]:
brics.shape

(5, 4)

In [152]:
brics.size

20

In [153]:
brics.count()

country       5
population    5
area          5
capital       5
dtype: int64

In [154]:
brics.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, BR to SA
Data columns (total 4 columns):
country       5 non-null object
population    5 non-null int64
area          5 non-null int64
capital       5 non-null object
dtypes: int64(2), object(2)
memory usage: 200.0+ bytes

In [155]:
silso.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 10 entries, 1818-01-01 to 1818-01-10
Data columns (total 4 columns):
year_month_day    10 non-null datetime64[ns]
dec_date          10 non-null float64
sunspots          4 non-null float64
definite          10 non-null int64
dtypes: datetime64[ns](1), float64(2), int64(1)
memory usage: 400.0 bytes

### DataFrame Series

In [156]:
country = brics['country']
country

BR          Brazil
RU          Russia
IN           India
CH           China
SA    South Africa
Name: country, dtype: object

In [157]:
type(country)

pandas.core.series.Series

In [158]:
country.head(2)

BR    Brazil
RU    Russia
Name: country, dtype: object

In [159]:
country.tail(2)

CH           China
SA    South Africa
Name: country, dtype: object

In [160]:
list_series = pd.Series([1, 2, 3, 4])
list_series

0    1
1    2
2    3
3    4
dtype: int64

### Broadcasting

In [161]:
users_df['fees'] = 0
users_df

     city  signups  visitors weekday  fees
0  Austin        7       139     Sun     0
1  Dallas       12       237     Sun     0
2  Austin        3       326     Mon     0
3  Dallas        5       456     Mon     0

In [162]:
brics['on_earth'] = [True, True, True, True, True]
brics

         country  population      area    capital on_earth
BR        Brazil         200   8515767   Brasilia     True
RU        Russia         144  17098242     Moscow     True
IN         India        1252   3287590  New Delhi     True
CH         China        1357   9596961    Beijing     True
SA  South Africa          55   1221037   Pretoria     True

### Slicing DataFrame

In [163]:
brics.iloc[:2,:]

   country  population      area   capital on_earth
BR  Brazil         200   8515767  Brasilia     True
RU  Russia         144  17098242    Moscow     True

In [164]:
brics.iloc[-2:,:]

         country  population     area   capital on_earth
CH         China        1357  9596961   Beijing     True
SA  South Africa          55  1221037  Pretoria     True

In [165]:
brics.iloc[1:3,:]

   country  population      area    capital on_earth
RU  Russia         144  17098242     Moscow     True
IN   India        1252   3287590  New Delhi     True

### DataFrame label & column access

In [166]:
brics.loc[['BR']]

   country  population     area   capital on_earth
BR  Brazil         200  8515767  Brasilia     True

In [167]:
brics.loc[['BR', 'CH']]

   country  population     area   capital on_earth
BR  Brazil         200  8515767  Brasilia     True
CH   China        1357  9596961   Beijing     True

In [169]:
silso = silso[['sunspots', 'definite']]
silso

            sunspots  definite
date
1818-01-01       NaN         1
1818-01-02       NaN         1
1818-01-03       NaN         1
1818-01-04      22.0         1
1818-01-05       NaN         1
1818-01-06       NaN         1
1818-01-07       NaN         1
1818-01-08      46.0         1
1818-01-09      59.0         1
1818-01-10      63.0         1

### Element access

array([['Brazil', 200, 8515767, 'Brasilia', True],
       ['Russia', 144, 17098242, 'Moscow', True],
       ['India', 1252, 3287590, 'New Delhi', True],
       ['China', 1357, 9596961, 'Beijing', True],
       ['South Africa', 55, 1221037, 'Pretoria', True]], dtype=object)

numpy.ndarray

### DataFrame 'n' NumPy

In [34]:
brics_area_log10 = np.log10(brics[['area']])
brics_area_log10

        area
BR  6.930224
RU  7.232951
IN  6.516878
CH  6.982134
SA  6.086729

In [35]:
type(brics_area_log10)

pandas.core.frame.DataFrame

In [54]:
brics.index.values

array(['BR', 'RU', 'IN', 'CH', 'SA'], dtype=object)

In [55]:
type(brics.index.values)

numpy.ndarray

In [56]:
brics.columns.values

array(['country', 'population', 'area', 'capital', 'on_earth'], dtype=object)

In [57]:
type(brics.columns.values)

numpy.ndarray

In [50]:
brics.values

array([['Brazil', 200, 8515767, 'Brasilia', True],
       ['Russia', 144, 17098242, 'Moscow', True],
       ['India', 1252, 3287590, 'New Delhi', True],
       ['China', 1357, 9596961, 'Beijing', True],
       ['South Africa', 55, 1221037, 'Pretoria', True]], dtype=object)

In [51]:
type(brics.values)

numpy.ndarray

In [52]:
brics['country'].values

array(['Brazil', 'Russia', 'India', 'China', 'South Africa'], dtype=object)

In [53]:
type(brics['country'].values)

numpy.ndarray

In [59]:
brics.loc['BR'].values

array(['Brazil', 200, 8515767, 'Brasilia', True], dtype=object)

In [60]:
type(brics.loc['BR'].values)

numpy.ndarray